app/controllers/events_controller.rb

INSERT INTO "events" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "nabeel"], ["user_id", 2], ["created_at", "2019-10-16 09:53:18.193542"], ["updated_at", "2019-10-16 09:53:18.193542"]]
---
  def create
    @event = current_user.events.create!(event_params)

UPDATE "events" SET "name" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["name", "nabeel mustafa"], ["updated_at", "2019-10-16 09:53:37.829104"], ["id", 3]]
---
  def update
    @event.update(event_params)

SELECT  "events".* FROM "events" WHERE "events"."user_id" = $1 AND "events"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 3], ["LIMIT", 1]]
---
  def set_event
    @event = current_user.events.find(params[:id])